{
    "home_details": {
        "title": [
            { "text": "Hi, I'm\n" },
            { "text": "Chris Webb", "color": "primary"}
        ],
        "subtitle" : "I am a full-stack developer of software and web applications"
    },
    "about_details": {
        "title": "I'm Chris, a full-stack developer",
        "text": "Having worked in web development for the past 5 years, my passion for the industry has only grown, as have my skills.\nWorking as a Product Developer for the NHS, I have worked to develop robust JavaScript applications that work in a 3rd party framework to provide integral patient support. I have also developed several full-stack applications tailored to the customer's needs. This has given me experience with working with PHP to create RESTful APIs, connecting to a wide variety of databases (PostgreSQL, MySQL, Microsoft SQL Server & MongoDB), as well as Angular, TypeScript, jQuery, SASS and HTML5 on the front-end to provide a useful and intuitive user experience.\nAs well as web applications, I have also designed and deployed hybrid applications (Ionic Framework) to work alongside these products, also using Angular. These skills I have gained have allowed me to work to mentor and pass on this knowledge to fellow developers in my team.\nThis passion has also carried over to my personal projects, where I have pushed the boundaries of my knowledge. I have experimented with Laravel and SQLite to build a simple website backend, using React as a clean and user-friendly front-end. I have worked with ASP.NET Core and C# to build workable web applications. I have also used Entity Framework in this to explore what is possible with building databases. This knowledge of C# and design practice I have also used to try my hand at game development, initially in Unity and now in Godot.\nRegardless of what I craft, I aim to bring the same passion for tinkering and problem-solving.",
        "skills": [
            { "name": "Angular", "exp": 100 },
            { "name": "TypeScript", "exp": 100 },
            { "name": "SASS", "exp": 100 },
            { "name": "PHP", "exp": 100 },
            { "name": "Ionic Framework", "exp": 100 },
            { "name": "SQL (SQL Server, MySQL, PostgreSQL)", "exp": 100 },
            { "name": "HTML5", "exp": 100 },
            { "name": "CSS3", "exp": 100 },
            { "name": "JavaScript", "exp": 10 },
            { "name": "jQuery", "exp": 100 },
            { "name": "Bootstrap", "exp": 100 },
            { "name": "Git", "exp": 100 },
            { "name": "C#", "exp": 100 },
            { "name": "ASP.NET Core", "exp": 90 },
            { "name": "Entity Framework", "exp": 80 },
            { "name": "RESTful APIs", "exp": 95 },
            { "name": "WordPress", "exp": 75 },
            { "name": "Python", "exp": 65 },
            { "name": "Laravel", "exp": 50 },
            { "name": "React", "exp": 50 },
            { "name": "NoSQL (MongoDB)", "exp": 50 }
        ]
    },
    "projects_details": {},
    "contact_details": {
        "title": "",
        "text": "Want to get in touch? I am available on at the links below:",
        "contacts": {
            "email": "webb.christopher@live.co.uk",
            "linkedIn": "webb-christopher",
            "gitHub": "ChrisWebbDeveloper"
        }
    }
}