{
    "home_details": {
        "title": [
            { "text": "Hi, I'm\n" },
            { "text": "Chris Webb", "color": "primary"}
        ],
        "subtitle" : "I am a full-stack developer of software and web applications"
    },
    "about_details": {
        "title": "I'm Chris, a full-stack developer",
        "text": "Having worked in web development for the past 5 years, my passion for the industry has only grown, as have my skills.\nWorking as a Product Developer for the NHS, I have worked to develop robust JavaScript applications that work in a 3rd party framework to provide integral patient support. I have also developed several full-stack applications tailored to the customer's needs. This has given me experience with working with PHP to create RESTful APIs, connecting to a wide variety of databases (PostgreSQL, MySQL, Microsoft SQL Server & MongoDB), as well as Angular, TypeScript, jQuery, SASS and HTML5 on the front-end to provide a useful and intuitive user experience.\nAs well as web applications, I have also designed and deployed hybrid applications (Ionic Framework) to work alongside these products, also using Angular. These skills I have gained have allowed me to work to mentor and pass on this knowledge to fellow developers in my team.\nThis passion has also carried over to my personal projects, where I have pushed the boundaries of my knowledge. I have experimented with Laravel and SQLite to build a simple website backend, using React as a clean and user-friendly front-end. I have worked with ASP.NET Core and C# to build workable web applications. I have also used Entity Framework in this to explore what is possible with building databases. This knowledge of C# and design practice I have also used to try my hand at game development, initially in Unity and now in Godot.\nRegardless of what I craft, I aim to bring the same passion for tinkering and problem-solving.",
        "skills": [
            { "name": "Angular", "exp": 100 },
            { "name": "TypeScript", "exp": 100 },
            { "name": "SASS", "exp": 100 },
            { "name": "PHP", "exp": 100 },
            { "name": "Ionic Framework", "exp": 100 },
            { "name": "SQL (SQL Server, MySQL, PostgreSQL)", "exp": 100 },
            { "name": "HTML5", "exp": 100 },
            { "name": "CSS3", "exp": 100 },
            { "name": "JavaScript", "exp": 100 },
            { "name": "jQuery", "exp": 100 },
            { "name": "Bootstrap", "exp": 100 },
            { "name": "Git", "exp": 100 },
            { "name": "C#", "exp": 100 },
            { "name": "ASP.NET Core", "exp": 90 },
            { "name": "Entity Framework", "exp": 80 },
            { "name": "RESTful APIs", "exp": 95 },
            { "name": "WordPress", "exp": 75 },
            { "name": "Python", "exp": 65 },
            { "name": "Laravel", "exp": 50 },
            { "name": "React", "exp": 50 },
            { "name": "NoSQL (MongoDB)", "exp": 50 }
        ]
    },
    "projects_details": {
        "projects": [
            {
                "title": "Kelly Daniels Photography",
                "description": "A photography portfolio website developed using Wordpress. A theme has been used and overhauled with custom styling via css as well as alteration to PHP throughout. This is maintained using the Wordpress admin tools and run using a MySQL database.",
                "link": null,
                "img": "kelly-daniels-photography.jpg",
                "start_date": "2017-09-01",
                "end_date": "2017-10-01",
                "tech_stack": [
                    "WordPress",
                    "PHP",
                    "MySQL",
                    "CSS3"
                ]
            },
            {
                "title": "Chris Webb Developer (v1)",
                "description": "The first version of my website. Then named deanwebbdeveloper.com, it was used to showcase the technologies I had learned up to that point. This included HTML5, CSS3, JavaScript, jQuery, PHP, MYSQL, and Python. It also demonstrated my ability to work with API calls.\nThis website also included a PHP email form that would automatically send emails to me with the details provided.",
                "link": "https://github.com/ChrisWebbDeveloper/chriswebbdeveloper.co.uk-v1",
                "img": "chris-webb-developer-v1.jpg",
                "start_date": "2018-03-20",
                "end_date": "2018-09-23",
                "tech_stack": [
                    "HTML5",
                    "CSS3",
                    "JavaScript",
                    "jQuery",
                    "PHP",
                    "MySQL",
                    "Python"
                ]
            },
            {
                "title": "Photography Portfolio Builder",
                "description": "An ASP.Net Core 5 project that allows users to log in and arrange, display and sort portfolios. This allows photos to be uploaded, details and titles provided, and then included in various portfolios, and potentially in different categories. Portfolios can be kept in draft, privatised, or featured.\nAbout sections allow details and images to be included, and Contacts allows social media links to be included. This links to a MySQL database, and uses Typescript and SASS for functionality and styling.",
                "link": "https://github.com/ChrisWebbDeveloper/photography-portfolio-builder",
                "img": "photography-portfolio-builder.jpg",
                "start_date": "2021-08-23",
                "end_date": "2022-02-14",
                "tech_stack": [
                    "ASP.NET Core 5",
                    "C#",
                    "Entity Framework",
                    "MySQL",
                    "TypeScript",
                    "Gulp.js",
                    "SASS",
                    "CSS3",
                    "Bootstrap",
                    "HTML5"
                ]
            },
            {
                "title": "Chris Webb Developer (v2)",
                "description": "The second version of my website. This was designed using Laravel with React components, and provided with bootstrap styling via ReactBootstrap.\nThe backend has been used to provide APIs for pulling through the information displayed here (linked to an SQLite database), as well as handling the Contact form through Sendgrid.\nSASS is also used throughout for elegant styling, transpiled to CSS3 via Gulp.js.",
                "link": "https://github.com/ChrisWebbDeveloper/chriswebbdeveloper.co.uk-v2",
                "img": "chris-webb-developer-v2.jpg",
                "start_date": "2021-08-04",
                "end_date": "2022-06-25",
                "tech_stack": [
                    "Laravel",
                    "PHP",
                    "SQLite",
                    "React",
                    "JavaScript",
                    "SASS",
                    "CSS3",
                    "Bootstrap",
                    "HTML5"
                ]
            },
            {
                "title": "Chris Webb Developer (v3)",
                "description": "You are here, the third version of my website! This is a more streamlined version of my portfolio, opting to use Angular with a simple JSON object to pull my details from, similar to an API call. It also has used SASS for simple, elegant styling.",
                "link": "https://github.com/ChrisWebbDeveloper/chriswebbdeveloper.co.uk",
                "img": "chris-webb-developer-v3.jpg",
                "start_date": "2023-12-16",
                "end_date": null,
                "tech_stack": [
                    "Angular",
                    "TypeScript",
                    "SASS",
                    "CSS3",
                    "Bootstrap",
                    "HTML5"
                ]
            },
            {
                "title": "Archipelago Game",
                "description": "Trying my hand at something different, I have experimented with game development. Taking my fondness and love of old-school top-down games like Zelda and Final Fantasy, I have started to build a top-down dungeon-crawler with combat that involves status effects and weapons of different style, speed, damage and other abilities.\nThis was initially built in Unity but rebuilt in Godot, opting to use C# to build components. I have also designed all of my own artwork in GIMP via 16x16 sprites.\nThis continues to be an experimental project for me, and something I continue with in my spare time",
                "link": null,
                "img": "archipelago.gif",
                "start_date": "2022-04-01",
                "end_date": null,
                "tech_stack": [
                    "C#",
                    "Godot",
                    "Unity",
                    "GIMP"
                ]
            }
        ]
    },
    "contact_details": {
        "text": "Want to get in touch? I am available on at the links below:",
        "contacts": {
            "email": "webb.christopher@live.co.uk",
            "linkedin": "webb-christopher",
            "github": "ChrisWebbDeveloper"
        }
    }
}